#+TITLE: Nix Setup and Usage
#+SETUPFILE: links.org

** Searching Nix files

Each of the Nix files in this project (files with a ".nix" extension) contains
exactly one Nix expression. This expression evaluates to one of the following
values:

- simple primitives and functions
- /derivations/ of packages that can be built and installed with Nix
- containers of values, allowing a single value to provide multiple values of
  different types, including more containers of values.

Once you learn the Nix language, you can read these files to see what kind of
values they build. We can use the =nix search= command to see what package
derivations a Nix expression contains. For example from the root directory of
this project, we can execute:

#+NAME: nix-derivation-show
#+BEGIN_SRC sh :dir .. :results output silent :exports none
nix show-derivation --file default.nix >/dev/null 2>&1
#+END_SRC

#+BEGIN_SRC sh :eval no
nix search --file default.nix --no-cache
#+END_SRC

#+NAME: nix-search
#+BEGIN_SRC sh :dir .. :results output :exports results :post crop(text=*this*, first-n=9, last-n=0)
nix search --file default.nix --no-cache | ansifilter
#+END_SRC

#+RESULTS: nix-search
#+begin_example
,* cabal-install (cabal-install)
  The command-line interface for Cabal and Hackage

,* direnv (direnv)
  A shell extension that manages your environment

,* direnv-nix-lorelei (direnv-nix-lorelei)
  Alternative Nix functions for Direnv

…
#+end_example

If you don't get the results above, see the [[#nix-drv][section on understanding derivations]]
for an explanation of a likely problem and workaround.

Note that because for extremely large Nix expressions, searching can be slow,
=nix search= by default returns results from searching an indexed cache. This
cache is updated explicitly (with an =--update-cache= switch) but may be
inconsistent with what you really want to search. It can be confusing to get
incorrect results due to an inconsistent cache. However, because small local
projects rarely have that many package derivations we don't really need the
cache, and can bypass it with the =--no-cache= switch, as used above. This
guarantees accurate results that are fast enough. So for the purposes of this
project, it's recommended to always use =--no-cache=.

The output of =nix search= is formatted as

#+BEGIN_EXAMPLE
    ,* attribute-path (name-of-package)
      Short description of package
#+END_EXAMPLE

/Attribute paths/ are used to select values from Nix sets that might be nested.
A dot delimits /attributes/ in the path. For instance an attribute path of =a.b=
selects a value from a set with an =a= attribute that has set with a =b=
attribute, that then has the value to select.

If the Nix expression we're searching evaluates to a single derivation (not in a
container), the attribute path will be missing from the =nix search= result.

Many Nix commands evaluate Nix files. If you specify a directory instead, the
command will look for a =default.nix= file within to evaluate. So from the root
directory of this project, we could use =.= instead of =default.nix=:

#+NAME: nix-search-alt
#+BEGIN_SRC sh :dir .. :results output silent
nix search --file . --no-cache
#+END_SRC

In the remainder of this document, we'll use =.= instead of =default.nix= since
this is conventional for Nix.

** Building Nix expressions

The following result is one returned by our prior execution of ~nix search
--no-cache --file .~:

#+NAME: nix-search-specific
#+BEGIN_SRC sh :dir .. :results output :exports results :noweb yes
nix search --no-cache --file . | ansifilter \
    | grep --color=never --after-context=1 '* <<get("package-attr")>> ('
#+END_SRC

#+RESULTS: nix-search-specific
: * hls-renamed (haskell-language-server-ghc8106-renamed)
:   Haskell Language Server (HLS) for GHC 8.10.6, renamed binary

We can see that a package named {{{package-name}}} can be accessed with the
{{{package-attr}}} attribute path in the Nix expression in the project root's
=default.nix=. Not shown in the search results above, this package happens to
provide the {{{package-type}}} {{{package-target}}}.

We can build this package with =nix build= from the project root:

#+NAME: nix-build
#+BEGIN_SRC sh :dir .. :results output silent :noweb yes
nix build --file . <<get("package-attr")>>
#+END_SRC

The positional arguments to =nix build= are /installables/, which can be
referenced by attribute paths. If you supply none then all derivations found are
built by default.

All packages built by Nix are stored in =/nix/store=. Nix won't rebuild packages
found there. Once a package is built, its content in =/nix/store= is read-only
(until the package is garbage collected, discussed later).

After a successful call of =nix build=, you'll see one or more symlinks for each
package requested in the current working directory. These symlinks by default
have a name prefixed with "result" and point back to the respective build in
=/nix/store=:

#+NAME: nix-build-link
#+BEGIN_SRC sh :dir .. :results output :exports both
readlink result*
#+END_SRC

#+RESULTS: nix-build-link
: /nix/store/pchxgvxqy4xls4i5hjizfnq563yf6h22-haskell-language-server-ghc8106-renamed

Following these symlinks, we can see the files the project provides:

#+NAME: nix-build-tree
#+BEGIN_SRC sh :dir .. :results output :exports both :post crop(text=*this*, first-n=10, last-n=0)
tree -l result*
#+END_SRC

#+RESULTS: nix-build-tree
#+begin_example
result
├── bin
│   └── haskell-language-server-8.10.6
└── share
    ├── bash-completion
    │   └── completions
    │       └── haskell-language-server-8.10.6.bash
    ├── fish
    │   └── vendor_completions.d
    │       └── haskell-language-server-8.10.6.fish
…
#+end_example

It's common to configure these "result" symlinks as ignored in source control
tools (for instance, for Git within a =.gitignore= file).

=nix build= has a =--no-link= switch in case you want to build packages without
creating "result" symlinks. To get the paths where your packages are located,
you can use =nix path-info= after a successful build:

#+NAME: nix-build-path
#+BEGIN_SRC sh :dir .. :results output :exports both :noweb yes
nix path-info --file . <<get("package-attr")>>
#+END_SRC

#+RESULTS: nix-build-path
: /nix/store/pchxgvxqy4xls4i5hjizfnq563yf6h22-haskell-language-server-ghc8106-renamed

** Running commands

We can run commands in Nix-curated environments with =nix run=. Nix will take
executables found in packages, put them in an environment's =PATH=, and then
execute a user-specified command.

With =nix run=, you don't even have to build the package first with =nix build=
or mess around with "result" symlinks. =nix run= will build the project if it's
not yet been built.

For example, to get the help message for the {{{run-target}}} executable
provided by the {{{run-name}}} package selected by the {{{run-attr}}} attribute
path from {{{run-src}}}, we can call the following:

#+NAME: nix-run
#+BEGIN_SRC sh :dir .. :results output :exports both :noweb yes :post crop(text=*this*, first-n=5, last-n=0)
nix run \
    --file <<get("run-src")>> \
    <<get("run-attr")>> \
    --command <<get("run-target")>> --help
#+END_SRC

#+RESULTS: nix-run
: haskell-language-server - GHC Haskell LSP server
: 
: Usage: haskell-language-server [--version | --numeric-version | --probe-tools | 
:                                  --print-cradle | 
:                                  [COMMAND | --lsp | FILES/DIRS...] [--cwd DIR] 
: …

Thus far, the argument of the =--file= switch has always referenced a Nix file
on our local filesystem. However, it's possible to reference a Nix expression
downloaded from the internet. The Nix ecosystem is supported by a giant GitHub
repository of Nix expressions called [[nixpkgs][Nixpkgs]]. Special branches of this
repository are considered /channels/ in the Nix ecosystem. A Nixpkgs branch of
"{{{nixos-release}}}" can be referenced by "channel:{{{nixos-release}}}" for
=nix= subcommands that accept a =--file= switch.

Again, as with =nix build=, attribute paths are specified as positional
arguments to select packages.

The command to run is specified after the =--command= switch. =nix run= runs the
command in a shell set up with a =PATH= environment variable including all the
=bin= directories provided by the selected packages.

=nix run= also supports an =--ignore-environment= flag that restricts =PATH= to
only packages selected, rather than extending the =PATH= of the caller's
environment. With =--ignore-environment=, the invocation is more sandboxed.

** Installing and uninstalling programs

We've seen that we can build programs with =nix build= and then execute them
using the "result" symlink (=result/bin/*=). Additionally, we've seen that you
can run programs with =nix run=. But these additional steps and
switches/arguments can feel extraneous. It would be nice if we could just have
the programs on our =PATH=. This is what =nix-env= is for.

=nix-env= maintains a symlink tree, called a /profile/, of installed programs.
The active profile is pointed to by a symlink at =~/.nix-profile=. By default,
this profile points to =/nix/var/nix/profiles/per-user/$USER/profile=. But you
can point your =~/.nix-profile= to any writable location with the
=--switch-profile= switch:

#+BEGIN_SRC sh :eval no
nix-env --switch-profile /nix/var/nix/profiles/per-user/$USER/another-profile
#+END_SRC

This way, you can just put =~/.nix-profile/bin= on your =PATH=, and any programs
installed in your currently active profile will be available for interactive use
or scripts.

We can query what's installed in the active profile with the =--query= switch:

#+NAME: nix-env-query-1
#+BEGIN_SRC sh :session env :results output silent
nix-env --query
#+END_SRC

To install the {{{package-target}}} {{{package-type}}}, which is accessed by the
{{{package-attr}}} in our top-level =default.nix= file, we'd run the following:

#+NAME: nix-env-install
#+BEGIN_SRC sh :session env :results output :exports both :noweb yes :post crop(text=*this*, first-n=1, last-n=3)
nix-env --install --file . --attr <<get("package-attr")>> 2>&1
#+END_SRC

#+RESULTS: nix-env-install
: installing 'haskell-language-server-ghc8106-renamed'
: trace: WARNING: 8.10.6 is out of date, consider using 8.10.7.

We can see this installation by querying what's been installed:

#+NAME: nix-env-query-2
#+BEGIN_SRC sh :session env :results output :exports both
nix-env --query
#+END_SRC

#+RESULTS: nix-env-query-2
: haskell-language-server-ghc8106-renamed

And if we want to uninstall a program from our active profile, we do so by its
name, in this case {{{package-name}}}:

#+NAME: nix-env-uninstall
#+BEGIN_SRC sh :session env :results output :exports both :noweb yes
nix-env --uninstall <<get("package-name")>> 2>&1
#+END_SRC

#+RESULTS: nix-env-uninstall
: uninstalling 'haskell-language-server-ghc8106-renamed'

Note that we've installed our package using its attribute path
({{{package-attr}}}) within the referenced Nix expression. But we uninstall it
using the package name ({{{package-name}}}), which may or may not be the same as
the attribute path. When a package is installed, Nix keeps no reference to the
expression that evaluated to the derivation of the installed package. The
attribute path is only relevant to this expression. In fact, two different
expressions could evaluate to the same derivation, but use different attribute
paths. This is why we uninstall packages by their package name.

Also, if you look at the location for your profile, you'll see that Nix retains
the symlink trees of previous generations of your profile. In fact you can even
rollback to a previous profile with the =--rollback= switch. You can delete old
generations of your profile with the =--delete-generations= switch.

See the [[nix-env][documentation for =nix-env=]] for more details.

